<!-- RAW -->

In [31]:
%pip install pandas psycopg2

Requirement already satisfied: pandas in c:\users\venka\appdata\local\programs\python\python312\lib\site-packages (2.2.3)Note: you may need to restart the kernel to use updated packages.

Requirement already satisfied: psycopg2 in c:\users\venka\appdata\local\programs\python\python312\lib\site-packages (2.9.9)
Requirement already satisfied: numpy>=1.26.0 in c:\users\venka\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2.1.2)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\venka\appdata\roaming\python\python312\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\venka\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\venka\appdata\local\programs\python\python312\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\venka\appdata\roaming\python\python312\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
import pandas as pd 
import psycopg2
import random
import numpy as np

In [33]:
conn = psycopg2.connect(
    host = 'localhost',
    database = 'postgres',
    user = "postgres",
    password = 'vishal'
)

OperationalError: connection to server at "localhost" (::1), port 5432 failed: Connection refused (0x0000274D/10061)
	Is the server running on that host and accepting TCP/IP connections?
connection to server at "localhost" (127.0.0.1), port 5432 failed: Connection refused (0x0000274D/10061)
	Is the server running on that host and accepting TCP/IP connections?

In [4]:
query = "Select * from public.employees"
df = pd.read_sql(query, conn)
df.to_csv('employees.csv')
query = "Select * from public.performance"
df = pd.read_sql(query, conn)
df.to_csv('performance.csv')
query = "Select * from public.trainings"
df = pd.read_sql(query, conn)
df.to_csv('trainings.csv')

C:\Users\VishalR\AppData\Local\Temp\ipykernel_16952\424329127.py:2: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)
C:\Users\VishalR\AppData\Local\Temp\ipykernel_16952\424329127.py:5: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)
C:\Users\VishalR\AppData\Local\Temp\ipykernel_16952\424329127.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(query, conn)

In [5]:
conn.close()

In [3]:
employee_df = pd.read_csv('./raw/employees.csv')
performance_df = pd.read_csv('./raw/performance.csv')
training_df = pd.read_csv('./raw/trainings.csv')
employee_details = pd.read_csv('./raw/employee_promotion.csv')  # E.g., 'employees.csv'

In [4]:
employee_df.head()

   Unnamed: 0  id             name                  email        designation
0           0   1    Alice Johnson      alice@example.com  Software Engineer
1           1   2        Bob Smith        bob@example.com    Project Manager
2           2   3  Catherine Davis  catherine@example.com         HR Manager
3           3   4        David Lee      david@example.com       Data Analyst
4           4   5     Eva Martinez        eva@example.com      IT Specialist

In [5]:
performance_df.head()

,Unnamed: 0,id,emp_id,training_id,score,trainer_Feedback,employee_feedback
0,0,2,2,2,90.0,Excellent performance! You’ve shown great dedi...,NaN
1,1,3,3,3,88.0,Nice work! There’s always room for improvement.,NaN
2,2,4,4,4,92.0,Well done! You exceeded expectations and set a...,NaN
3,3,5,5,5,87.0,Good performance! Focus on your weaknesses for...,NaN
4,4,6,6,6,80.0,"You did well, but I know you can achieve more.",NaN

In [6]:
training_df.head()

,Unnamed: 0,id,name,start_date,end_date
0,0,1,Leadership Training,2024-01-09 18:30:00+00:00,2024-01-14 18:30:00+00:00
1,1,2,Technical Workshop,2024-02-04 18:30:00+00:00,2024-02-09 18:30:00+00:00
2,2,3,Compliance Training,2024-02-29 18:30:00+00:00,2024-03-06 18:30:00+00:00
3,3,4,Project Management,2024-04-11 18:30:00+00:00,2024-04-19 18:30:00+00:00
4,4,5,Advanced JavaScript,2024-05-13 18:30:00+00:00,2024-05-17 18:30:00+00:00

In [7]:
employee_details.head()

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,awards_won,avg_training_score,is_promoted
0,65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,0,49.0,0
1,65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,60.0,0
2,7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,50.0,0
3,2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,50.0,0
4,48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,73.0,0

In [8]:
# prep

In [9]:
# Selecting columns and renaming 'department' to 'designation'
employee_extract = employee_details[['employee_id', 'department', 'age', 'length_of_service', 'is_promoted']].rename(columns={'department': 'designation'})
employee_extract

       employee_id        designation  age  length_of_service  is_promoted
0            65438  Sales & Marketing   35                  8            0
1            65141         Operations   30                  4            0
2             7513  Sales & Marketing   34                  7            0
3             2542  Sales & Marketing   39                 10            0
4            48945         Technology   45                  2            0
...            ...                ...  ...                ...          ...
54803         3030         Technology   48                 17            0
54804        74592         Operations   37                  6            0
54805        13918          Analytics   27                  3            0
54806        13614  Sales & Marketing   29                  2            0
54807        51526                 HR   27                  5            0

[54808 rows x 5 columns]

In [10]:

# Sample lists of first and last names for random generation
first_names = ['Alice', 'Bob', 'Catherine', 'David', 'Eva', 'Frank', 'Grace', 'Harry', 'Isabella', 'Jack', 
               'Karen', 'Liam', 'Mia', 'Noah', 'Olivia', 'Paul', 'Quincy', 'Rachel', 'Sam', 'Tina', 'Uma', 
               'Victor', 'Wendy', 'Xander', 'Yvonne', 'Zach']

last_names = ['Johnson', 'Smith', 'Davis', 'Lee', 'Martinez', 'Wilson', 'Thompson', 'Brown', 'Moore', 'White', 
              'Green', 'Carter', 'Phillips', 'Evans', 'Taylor', 'Harris', 'Brooks', 'Wood', 'Walker', 'Edwards', 
              'Perez', 'Kelly', 'Morgan', 'Hill', 'Cooper', 'Baker']

In [11]:
# Function to generate random names and emails
def generate_random_name_email(num_employees, domain='gmail.com'):
    employees_data = []
    used_emails = set()  # To track used emails and avoid duplicates
    
    for _ in range(num_employees):
        first_name = random.choice(first_names)
        last_name = random.choice(last_names)
        full_name = f"{first_name} {last_name}"
        
        # Generate a unique email by checking against used emails
        email = f"{first_name.lower()}@{domain}"
        while email in used_emails:
            email = f"{first_name.lower()}_{last_name.lower()}{random.randint(1, 999)}@{domain}"
        used_emails.add(email)
        
        employees_data.append((full_name, email))
    
    return employees_data

In [30]:
num_employees = len(employee_details)
random_data = generate_random_name_email(num_employees)
random_df = pd.DataFrame(random_data, columns=['name', 'email'])
employee_combined = pd.concat([employee_details, random_df], axis=1)
employee_combined = employee_combined.rename(columns={'department': 'designation'})
employees_fill = employee_combined[['employee_id', 'name', 'email', 'designation', 'age', 'length_of_service', 'is_promoted']]
employees_fill.to_csv('./prep/employees.csv', index=False)
print("Final employee dataset with names and emails saved to 'final_employee_data_with_names_emails.csv'.")

Final employee dataset with names and emails saved to 'final_employee_data_with_names_emails.csv'.

In [31]:
training_ids = training_df['id'].unique()  # Get unique training IDs
training_ids

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

In [32]:
avg_scores_df = employee_details[["employee_id", "avg_training_score"]].copy()

performance_data = {
    'emp_id': [], 
    'training_id': [],  
    'score': [],  
    'trainer_Feedback': [], 
    'employee_feedback': [] 
}

In [33]:
for emp_id in avg_scores_df['employee_id']:
    for training_id in range(1, 11):  
        performance_data['emp_id'].append(emp_id)
        performance_data['training_id'].append(training_id)
        performance_data['score'].append(None)
        performance_data['trainer_Feedback'].append(None)
        performance_data['employee_feedback'].append(None)

In [34]:
performance_df = pd.DataFrame(performance_data)
performance_df = performance_df.merge(avg_scores_df, left_on='emp_id', right_on='employee_id', how='left')
performance_df['score'] = performance_df['avg_training_score']
performance_df.drop(columns=['avg_training_score', 'employee_id'], inplace=True)
performance_df.to_csv("./prep/performance.csv")

In [35]:
training_df.to_csv("./prep/trainings.csv")

In [36]:
#reporting

In [37]:
employee_df = pd.read_csv('./prep/employees.csv')

In [38]:
performance_summary = performance_df.groupby('emp_id').agg(
    no_of_trainings=('training_id', 'count'),  # Count of training sessions
    avg_training_score=('score', 'mean')  # Average score
).reset_index()

In [39]:
# Merge the performance summary with the employees DataFrame
report_df = employee_df.merge(
    performance_summary,
    how='left',
    left_on='employee_id',
    right_on='emp_id'
)

In [40]:
report_df.drop(columns='emp_id', inplace=True)
report_df.to_csv('./reporting/promotion_report.csv', index=False)